In [177]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\olkar\appdata\local\programs\python\python312\lib\site-packages (8.4.0)
Note: you may need to restart the kernel to use updated packages.

In [178]:
import mysql.connector
import pandas as pd
from sqlalchemy import create_engine

In [179]:

con = mysql.connector.connect(
    host = "giniewicz.it",
    user = "team07",
    password = "te@m24ot",
    database = "team07",
)

if(con):
    print("Połączenie udane")
else:
    print("Połączenie udane")

con.close()

Połączenie udane

In [239]:
input = """
        
CREATE TABLE klienci
(
  id                  INT           NOT NULL,
  imię                VARCHAR(255)  NULL    ,
  nazwisko            VARCHAR(255)  NULL    ,
  płeć                ENUM('K','M') NULL     DEFAULT NULL,
  PESEL               CHAR(11)      NULL    ,
  miasto              VARCHAR(255)  NULL    ,
  adres               VARCHAR(255)  NULL    ,
  karta_lojalnościowa BIT           NULL     DEFAULT 0 COMMENT '1 = posiada, 0 = nie posiada',
  telefon             VARCHAR(20)   NULL    ,
  email               VARCHAR(255)  NULL    ,
  PRIMARY KEY (id)
);

CREATE TABLE pracownicy
(
  id                INT          NOT NULL,
  imię              VARCHAR(255) NOT NULL,
  nazwisko          VARCHAR(255) NOT NULL,
  pesel             CHAR(11)     NOT NULL,
  miasto            VARCHAR(255) NOT NULL,
  adres             VARCHAR(255) NOT NULL,
  telefon           VARCHAR(20)  NOT NULL,
  email             VARCHAR(255) NOT NULL,
  data_zatrudnienia DATE         NOT NULL,
  data_zwolnienia   DATE         NOT NULL,
  stanowisko        VARCHAR(69)  NOT NULL COMMENT 'da się długośc jak ustalimy stanowiska',
  płaca             DECIMAL(5,2) NOT NULL COMMENT 'zł/h',
  PRIMARY KEY (id)
);

CREATE TABLE samochody
(
  id              INT                       NOT NULL,
  marka           VARCHAR(25)               NOT NULL,
  model           VARCHAR(25)               NOT NULL,
  liczba_kół      ENUM('2','4')             NOT NULL,
  rocznik         YEAR(4)                   NOT NULL,
  typ_nadwozia    VARCHAR(25)               NULL    ,
  czy_powypadkowy BIT                       NOT NULL DEFAULT 0,
  kolor           VARCHAR(25)               NOT NULL,
  typ_paliwa      VARCHAR(3)                NULL    ,
  pojemność       DECIMAL(2,1)              NULL    ,
  skrzynia_biegów ENUM('AUTOMAT', 'MANUAL') NOT NULL,
  liczba_drzwi    ENUM('0','3','5')         NOT NULL,
  liczba_miejsc   ENUM('1','2','5','7')     NOT NULL,
  czy_na_stanie   BIT                       NOT NULL DEFAULT 0,
  PRIMARY KEY (id)
);

CREATE TABLE sprzedaż_samochodu
(
  id                 INT                 NOT NULL,
  id_samochodu       INT                 NOT NULL,
  id_klienta         INT                 NOT NULL,
  id_pracownika      INT                 NOT NULL,
  cena               DECIMAL(12,2)       NOT NULL,
  liczba_rat         TINYINT(2) UNSIGNED NOT NULL DEFAULT 1,
  data_zaksięgowania DATE                NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE usługi
(
  id                 INT           NOT NULL,
  id_samochodu       INT           NOT NULL,
  id_klienta         INT           NOT NULL,
  id_pracownika      INT           NOT NULL,
  cena               DECIMAL(12,2) NOT NULL,
  data_zaksięgowania DATE          NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE użyte_części
(
  id        INT NOT NULL,
  id_usługi INT NOT NULL,
  id_części INT NOT NULL,
  ilość     INT NOT NULL DEFAULT 1,
  PRIMARY KEY (id)
);

CREATE TABLE wyposażenie
(
  id          INT           NOT NULL,
  nazwa       VARCHAR(69)   NOT NULL COMMENT 'da się długośc jak ustalimy typy rzeczy',
  atrybut     VARCHAR(50)   NULL    ,
  ilość       INT           NOT NULL DEFAULT 0,
  cena_części DECIMAL(12,2) NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE zakup_części
(
  id                 INT           NOT NULL,
  id_części          INT           NOT NULL,
  koszt              DECIMAL(12,2) NOT NULL,
  data_zakupu        DATE          NOT NULL,
  ilość              INT           NOT NULL DEFAULT 1,
  data_zaksięgowania DATE          NOT NULL,
  PRIMARY KEY (id)
);

CREATE TABLE zakup_samochodu
(
  id                 INT           NOT NULL,
  id_samochodu       INT           NOT NULL,
  id_pracownika      INT           NOT NULL,
  id_sprzedawcy      INT           NOT NULL,
  koszt              DECIMAL(12,2) NOT NULL,
  data_zaksięgowania DATE          NOT NULL,
  PRIMARY KEY (id)
);

ALTER TABLE użyte_części
  ADD CONSTRAINT FK_usługi_TO_użyte_części
    FOREIGN KEY (id_usługi)
    REFERENCES usługi (id);

ALTER TABLE użyte_części
  ADD CONSTRAINT FK_wyposażenie_TO_użyte_części
    FOREIGN KEY (id_części)
    REFERENCES wyposażenie (id);

ALTER TABLE usługi
  ADD CONSTRAINT FK_samochody_TO_usługi
    FOREIGN KEY (id_samochodu)
    REFERENCES samochody (id);

ALTER TABLE zakup_części
  ADD CONSTRAINT FK_wyposażenie_TO_zakup_części
    FOREIGN KEY (id_części)
    REFERENCES wyposażenie (id);

ALTER TABLE zakup_samochodu
  ADD CONSTRAINT FK_samochody_TO_zakup_samochodu
    FOREIGN KEY (id_samochodu)
    REFERENCES samochody (id);

ALTER TABLE sprzedaż_samochodu
  ADD CONSTRAINT FK_samochody_TO_sprzedaż_samochodu
    FOREIGN KEY (id_samochodu)
    REFERENCES samochody (id);

ALTER TABLE zakup_samochodu
  ADD CONSTRAINT FK_pracownicy_TO_zakup_samochodu
    FOREIGN KEY (id_pracownika)
    REFERENCES pracownicy (id);

ALTER TABLE sprzedaż_samochodu
  ADD CONSTRAINT FK_klienci_TO_sprzedaż_samochodu
    FOREIGN KEY (id_klienta)
    REFERENCES klienci (id);

ALTER TABLE usługi
  ADD CONSTRAINT FK_klienci_TO_usługi
    FOREIGN KEY (id_klienta)
    REFERENCES klienci (id);

ALTER TABLE sprzedaż_samochodu
  ADD CONSTRAINT FK_pracownicy_TO_sprzedaż_samochodu
    FOREIGN KEY (id_pracownika)
    REFERENCES pracownicy (id);

ALTER TABLE usługi
  ADD CONSTRAINT FK_pracownicy_TO_usługi
    FOREIGN KEY (id_pracownika)
    REFERENCES pracownicy (id);

ALTER TABLE zakup_samochodu
  ADD CONSTRAINT FK_klienci_TO_zakup_samochodu
    FOREIGN KEY (id_sprzedawcy)
    REFERENCES klienci (id);

        
      """

input = input.replace("CREATE", "CREATE OR REPLACE")

inputs = input.split(";")
inputs[0]

"\n        \nCREATE OR REPLACE TABLE klienci\n(\n  id                  INT           NOT NULL,\n  imię                VARCHAR(255)  NULL    ,\n  nazwisko            VARCHAR(255)  NULL    ,\n  płeć                ENUM('K','M') NULL     DEFAULT NULL,\n  PESEL               CHAR(11)      NULL    ,\n  miasto              VARCHAR(255)  NULL    ,\n  adres               VARCHAR(255)  NULL    ,\n  karta_lojalnościowa BIT           NULL     DEFAULT 0 COMMENT '1 = posiada, 0 = nie posiada',\n  telefon             VARCHAR(20)   NULL    ,\n  email               VARCHAR(255)  NULL    ,\n  PRIMARY KEY (id)\n)"

In [242]:
con = mysql.connector.connect(
    host = "giniewicz.it",
    user = "team07",
    password = "te@m24ot",
    database = "team07",
)

mycursor = con.cursor()

# klucze obce w innych tabelach związane z tą tabelą
mycursor.execute("SET FOREIGN_KEY_CHECKS = 0")

for i in range(len(inputs)-1):
    mycursor.execute(inputs[i])
    con.commit()

mycursor.execute("SET FOREIGN_KEY_CHECKS = 1")

mycursor.close()
con.close()

In [ ]:
pracownicy_df = pd.read_csv("outputs/pracownicy.csv", index_col=0)
pracownicy_df

,imię,nazwisko,pesel,miasto,adres,telefon,email,data_zatrudnienia,data_zwolnienia,stanowisko,płaca
id,,,,,,,,,,,
1,Klaudia,Grzybowska,69080636163,Wrocław,ul. Jana Franciszka Żaczka 68/24,48817136439,klaudia.grzybowska@kuba.pl,2014-01-01,NaN,menadżer,71.9
2,Marcin,Madera,78030693110,Wrocław,ul. Wczasowa 7/49,48377675599,marcin.madera@kuba.pl,2014-01-01,2014-11-07,sprzedawca,56.0
3,Kazimierz,Kashubskyi,84081384631,Wrocław,ul. Żeglarska 67/11,48563422528,kazimierz.kashubskyi@kuba.pl,2014-01-01,NaN,sprzedawca,49.2
4,Teresa,Krzemień,89021718426,Wrocław,ul. Parkowa 16/7,48417089673,teresa.krzemien@kuba.pl,2014-01-01,2017-10-18,mechanik,53.4
5,Tomasz,Brzostek,83012438137,Wrocław,ul. Toruńska 90/36,48749864738,tomasz.brzostek@kuba.pl,2014-01-01,NaN,informatyk,59.1
6,Jagoda,Plewińska,60043026342,Wrocław,ul. Tartaczna 98/25,48296794541,jagoda.plewinska@kuba.pl,2014-09-18,NaN,mechanik,54.5
7,Ryszard,Chrzanowski,88062510239,Wrocław,ul. Asnyka 3,48040766127,ryszard.chrzanowski@kuba.pl,2014-12-20,NaN,mechanik,57.8
8,Agata,Wierzchowska,84021557480,Zabrze,ul. Tetmajera 47/27,48438305260,agata.wierzchowska@kuba.pl,2015-07-28,NaN,mechanik,45.4
9,Jerzy,Koliweszka,82123016496,Zielona Góra,ul. Karola Miarki 60/26,48866864696,jerzy.koliweszka@kuba.pl,2016-02-14,NaN,mechanik,49.0
10,Agnieszka,Gajos,88122565344,Wrocław,ul. Miła 69,48133612526,agnieszka.gajos@kuba.pl,2016-03-08,2017-10-27,pomocnik mechanika,40.2
11,Dariusz,Żmij,74022384130,Wrocław,ul. Na Wzgórzu 60/28,48919001652,dariusz.zmij@kuba.pl,2016-04-30,NaN,pomocnik mechanika,44.1
12,Dorota,Nowakowska,68090650242,Słubice,ul. Wojska Polskiego 35/42,48098129771,dorota.nowakowska@kuba.pl,2017-01-12,NaN,diagnosta samochodowy,58.6
13,Magdalena,Gwizdała,89122572020,Wrocław,ul. Burdzyńskiego 56,48045041806,magdalena.gwizdala@kuba.pl,2017-03-09,NaN,sprzątający,35.7

In [ ]:
con = mysql.connector.connect(
    host = "giniewicz.it",
    user = "team07",
    password = "te@m24ot",
    database = "team07",
)

engine = create_engine('mysql+mysqlconnector://team07:te%40m24ot@giniewicz.it:3306/team07', echo=False)


pracownicy_df.to_sql(con=engine, name="pracownicy", if_exists="append")
con.commit()

con.close()